### Database Testing Notebook

#### You may need to pip install sqlalchemy and pymysql
    If so: "pip install *module*" then run

#### Import pandas, sqlachemy, and pymysql to get started -

In [1]:
import pandas as pd
import sqlalchemy
import pymysql

#### Next we make our configuration to connect to the DB -

In [2]:
con = sqlalchemy.create_engine('mysql+pymysql://root:Password123@localhost/tractortek')

#### Create your Data Frames -

In [3]:
df_a = pd.read_sql("oltp_weekly_sales",con)

df_b = pd.read_sql("prod_details",con)

df_c = pd.read_sql("sales_team",con)

df_d = pd.read_sql("week_breakdown",con)

df_e = pd.read_sql("hist_prod_sales",con)

df_f = pd.read_sql("hist_prod_sales_category",con)

df_g = pd.read_sql("hist_prod_sales_region",con)

df_h = pd.read_sql("hist_serv_sales",con)

df_i = pd.read_sql("hist_serv_sales_category",con)

df_j = pd.read_sql("hist_serv_sales_region",con)

df_k = pd.read_sql("hist_serv_sales_income",con)

df_l = pd.read_sql("quart_prod_inc_2019",con)

df_m = pd.read_sql("quart_prod_inc_2020",con)

#### With our Data Frames created we can now test to make sure the DB is set up and running correctly -

In [4]:
print(df_a.dtypes)

sale_id           int64
emp_id           object
prod_code        object
prod_quantity     int64
serv_plan        object
serv_quantity     int64
the_week          int64
the_year          int64
dtype: object

#### .head(#) will return the beginning rows of table based off a numeric input -

In [8]:
df_m.head(5)

,emp_id,region,prod_code,price,Q1_tot,Q2_tot,Q3_tot,Q4_tot,2020_Q1_inc,2020_Q2_inc,2020_Q3_inc,2020_Q4_inc
0,EMP234,NW,PROD_001,$12499,464,496,373,361,$5799536,$6199504,$4662127,$4512139
1,EMP234,NW,PROD_008,$11689,188,275,154,199,$2197532,$3214475,$1800106,$2326111
2,EMP234,NW,PROD_004,$11527,440,444,376,357,$5071880,$5117988,$4334152,$4115139
3,EMP234,NW,PROD_003,$15066,496,420,380,360,$7472736,$6327720,$5725080,$5423760
4,EMP234,NW,PROD_005,$14225,286,342,209,316,$4068350,$4864950,$2973025,$4495100

#### .tail(#) will return the last rows of a table based off a numeric input -

In [9]:
df_l.tail(7)

,emp_id,region,prod_code,price,Q1_tot,Q2_tot,Q3_tot,Q4_tot,2019_Q1_inc,2019_Q2_inc,2019_Q3_inc,2019_Q4_inc
33,EMP290,SW,PROD_002,$14786,154,205,137,163,$2277044,$3031130,$2025682,$2410118
34,EMP290,SW,PROD_003,$14999,208,187,110,126,$3119792,$2804813,$1649890,$1889874
35,EMP290,SW,PROD_004,$11385,148,154,133,166,$1684980,$1753290,$1514205,$1889910
36,EMP290,SW,PROD_005,$13995,143,175,114,127,$2001285,$2449125,$1595430,$1777365
37,EMP290,SW,PROD_006,$4575,149,141,107,129,$681675,$645075,$489525,$590175
38,EMP290,SW,PROD_007,$22987,121,179,92,110,$2781427,$4114673,$2114804,$2528570
39,EMP290,SW,PROD_008,$11589,133,120,122,112,$1541337,$1390680,$1413858,$1297968

#### The tests above show that we are actively connected to a running DB whilst validating the info we expect to see

#### Lets check the shape of another DF -

In [7]:
df_c.shape

(5, 4)

#### When checking a shape the returned numbers represent: ( "row count" , "column count" )

#### .dtypes will return the data type for each column -

In [8]:
df_c.dtypes

employee_id        object
sales_team_lead    object
pay_grade          object
region             object
dtype: object

#### .describe() will return a statistical description of a table -

In [9]:
df_a.describe()

         sale_id  prod_quantity  serv_quantity  the_week  the_year
count  25.000000      25.000000      25.000000      25.0      25.0
mean   13.000000      30.160000      13.440000       1.0    2021.0
std     7.359801       8.984616       7.234639       0.0       0.0
min     1.000000      12.000000       2.000000       1.0    2021.0
25%     7.000000      24.000000       7.000000       1.0    2021.0
50%    13.000000      32.000000      12.000000       1.0    2021.0
75%    19.000000      36.000000      19.000000       1.0    2021.0
max    25.000000      50.000000      28.000000       1.0    2021.0

#### .count() will give you the number of values in each column of a table -

In [10]:
df_j.count()

serv_plan         80
emp_id            80
region            80
the_year          80
total_quantity    80
dtype: int64

#### .value_counts() returns objects containing counts of unique values -

In [12]:
df_g.value_counts()

prod_code  emp_id  region  the_year  total_quantity
PROD_001   EMP234  NW      2019      1692              1
                           2020      1694              1
PROD_006   EMP290  SW      2019      526               1
           EMP267  SW      2020      1709              1
                           2019      1705              1
                                                      ..
PROD_003   EMP256  NW      2020      932               1
                           2019      927               1
           EMP244  NW      2020      1724              1
                           2019      1716              1
PROD_008   EMP290  SW      2020      490               1
Length: 80, dtype: int64

### You can run any of these tests and more to validate your DB is operational.

## Happy Analysis!